{
  "backend/main.mo": "Actor storing contact messages with timestamp-based IDs and providing submit and query functions.",
  "feature_evidence.json": "Feature evidence report listing two features, associated components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing each frontend file’s purpose and functionality.",
  "frontend/index.css": "Tailwind base setup defining light/dark theme CSS variables and global styles.",
  "frontend/index.html": "Base HTML template loading the React app and setting meta tags for SEO and social previews.",
  "frontend/src/App.tsx": "Main React component handling hash routing and rendering pages with persistent header and footer.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form component with validation, submission via mutation, and success/error alerts.",
  "frontend/src/components/download/ComingSoonCard.tsx": "Card displaying Android icon, Play Store coming-soon message, notify button, and release info.",
  "frontend/src/components/features/FeatureCards.tsx": "Grid of feature cards with icons and descriptions, animated via scroll reveal.",
  "frontend/src/components/gallery/GalleryPlaceholders.tsx": "Screenshot and video placeholder grids using reveal animations and static placeholder images.",
  "frontend/src/components/home/HeroSection.tsx": "Parallax hero section with title, tagline, call-to-action button, and developer info.",
  "frontend/src/components/site/Footer.tsx": "Footer showing logo, social links, and credits with neon-styled accents.",
  "frontend/src/components/site/Header.tsx": "Responsive header with logo, navigation links, and mobile sheet menu using hash routing.",
  "frontend/src/components/site/NeonButton.tsx": "Wrapper around Button that adds neon-button styling.",
  "frontend/src/components/site/NeonCard.tsx": "Reusable neon-styled card component with optional hover effects.",
  "frontend/src/components/site/SiteLayout.tsx": "Layout wrapper applying a site-layout container style.",
  "frontend/src/components/worldmap/WorldMapInteractive.tsx": "Interactive grid of world locations that highlights cards and reveals descriptions on hover or click.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication and stored identities.",
  "frontend/src/hooks/useParallax.ts": "Hook that returns a scroll-based offset value for parallax effects.",
  "frontend/src/hooks/useQueries.ts": "Defines mutation for submitting contact forms via the backend actor and invalidates related queries.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Hook using IntersectionObserver to mark an element visible when scrolled into view.",
  "frontend/src/index.css": "Global Tailwind styles with neon theme variables and component classes for buttons, cards, and gradients.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutGamePage.tsx": "Renders an About page with scroll-reveal sections describing the Axses game and feature highlight cards.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form with social links and response-time info using a reveal-on-scroll animation.",
  "frontend/src/pages/DownloadPage.tsx": "Shows a coming-soon download card and lists minimum and recommended system requirements.",
  "frontend/src/pages/FeaturesPage.tsx": "Presents a features overview page containing a header and a collection of feature cards.",
  "frontend/src/pages/GalleryPage.tsx": "Provides a gallery page framework with placeholder image components.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage with a hero section and animated feature cards introducing game highlights.",
  "frontend/src/pages/WorldMapPage.tsx": "Displays the world map image with reveal animation and an interactive map component.",
  "frontend/src/router/routes.ts": "Defines the application's client-side route list mapping paths to page components.",
  "frontend/src/router/useHashRouter.ts": "Implements a simple hash-based router hook with state updates on hash changes.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, typography, container settings, and animations.",
  "project_state.json": "Describes project metadata, image requirements, and tracked feature requests for background updates."
}