{
  "backend/main.mo": "Motoko actor storing contact messages by timestamp and exposing submit and query endpoints.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "List of frontend file paths with brief descriptions of each component or page.",
  "frontend/index.css": "Tailwind base styles and color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting metadata and loading the React application with title 'Axses'.",
  "frontend/src/App.tsx": "Main React component that selects a page via hash routing and renders it with header and footer.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form with validation, subject support, and backend submission via React Query.",
  "frontend/src/components/download/ComingSoonCard.tsx": "Neon-styled card showing Play Store coming‑soon info with notify button and release date.",
  "frontend/src/components/features/FeatureCards.tsx": "Grid of six feature cards with icons, descriptions, and scroll‑reveal animation.",
  "frontend/src/components/gallery/GalleryPlaceholders.tsx": "Placeholder grids for screenshots and videos with reveal animations and hover overlays.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with parallax background, title, tagline, CTA button, and developer info.",
  "frontend/src/components/site/Footer.tsx": "Footer showing logo, social links, and copyright note with neon-styled icons.",
  "frontend/src/components/site/Header.tsx": "Responsive header with logo and hash-based navigation supporting desktop and mobile menus.",
  "frontend/src/components/site/NeonButton.tsx": "Wrapper around Button that applies a neon-button class for styling.",
  "frontend/src/components/site/NeonCard.tsx": "Card component applying neon-card styling with optional hover effects.",
  "frontend/src/components/site/SiteLayout.tsx": "Layout wrapper applying a site-layout class around children.",
  "frontend/src/components/worldmap/WorldMapInteractive.tsx": "Interactive grid of world locations using NeonCard and icons, highlighting cards on hover or click.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages backend actor based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading identity, handling login/logout, and exposing auth state.",
  "frontend/src/hooks/useParallax.ts": "Returns a scroll-based offset value for creating parallax effects.",
  "frontend/src/hooks/useQueries.ts": "Provides mutation to submit a contact form through the backend actor and refresh related queries.",
  "frontend/src/hooks/useRevealOnScroll.ts": "IntersectionObserver-based hook revealing elements when they enter the viewport.",
  "frontend/src/index.css": "Tailwind CSS setup defining neon theme variables and component styles like neon buttons, cards, and gradients.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and Internet Identity provider.",
  "frontend/src/pages/AboutGamePage.tsx": "Renders the About page with scroll-reveal text and feature cards describing the game's world and environments.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form with social links and response-time info using a scroll-reveal effect.",
  "frontend/src/pages/DownloadPage.tsx": "Shows a coming-soon download card and lists minimum and recommended system requirements.",
  "frontend/src/pages/FeaturesPage.tsx": "Presents the game's features using a FeatureCards component within a standard layout.",
  "frontend/src/pages/GalleryPage.tsx": "Provides a gallery page with placeholder images inside the main site layout.",
  "frontend/src/pages/HomePage.tsx": "Builds the home page with a hero section and scroll-reveal feature cards highlighting world size, NPCs, and optimization.",
  "frontend/src/pages/WorldMapPage.tsx": "Displays a world map image with scroll-reveal effects and an interactive map component.",
  "frontend/src/router/routes.ts": "Defines the app's route list mapping paths to page components and labels.",
  "frontend/src/router/useHashRouter.ts": "Implements a simple hash-based router hook for navigation and route tracking.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including colors, typography, animations, and custom neon styling.",
  "project_state.json": "Describes the project state, existing features, pending requests, and metadata for the Axses frontend."
}