{
  "kind": "build_request",
  "title": "Replace hero section background with cinematic grunge gaming texture",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Generate a new cinematic grunge background image matching the requested mood (Cyberpunk × Samurai × Dark Souls) with black/charcoal texture, brushed/scratched paint effects, minimal abstract atmosphere, and (optionally) a non-literal warrior silhouette; ensure the image contains no characters, no faces, no logos, and no text, and avoid overly dark overall exposure and avoid excessive contrast (keep highlights subtle). Save it as a static asset in frontend/public/assets/generated and use the exact filename provided in the image requirements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Set section background as a dark cinematic gaming texture.\n\nStyle:\n\nBlack and charcoal grunge texture\n\nHigh contrast white highlights\n\nAbstract warrior silhouette\n\nBrush stroke / scratched paint effect\n\nMinimal, dramatic, moody\n\nFeel:\nCyberpunk × Samurai × Dark souls      \ndont use darck colours do not have extra contracs make litgty colour only use back color for dark coloring and extara contracs \nNo characters, no faces, no logos, no text.\nJust atmosphere."
        ]
      },
      "acceptanceCriteria": [
        "A new PNG exists at frontend/public/assets/generated/axses-hero-cinematic-texture.dim_1920x1080.png.",
        "The generated image is purely atmospheric: no readable text, no logos, no faces, and no identifiable character depiction.",
        "The overall exposure is not overly dark; contrast is controlled (no harsh/high-contrast highlights dominating the image).",
        "The image includes a black/charcoal grunge texture with brush/scratch effects; if a silhouette is present, it remains abstract and non-literal."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update the Home hero section background to use the new generated cinematic texture image instead of the current nature background, and adjust the existing overlay (the gradient layer on top of the image) to preserve a moody cinematic feel while respecting the request to avoid making the section too dark or overly high-contrast; keep all existing hero text and layout unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Set section background as a dark cinematic gaming texture."
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/components/home/HeroSection.tsx uses backgroundImage: url(/assets/generated/axses-hero-cinematic-texture.dim_1920x1080.png) (replacing the current /assets/generated/axses-hero-nature.dim_1920x1080.png).",
        "Hero content (title, studio name, tagline, CTA, credits block) remains present and positioned as before.",
        "The overlay/gradient on the hero background does not significantly darken the section beyond readability needs and does not introduce harsh contrast."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead).",
    "Use the existing static-asset pattern: generated images must be placed under frontend/public/assets/generated and referenced directly from the frontend (no backend image routing)."
  ],
  "nonGoals": [
    "No backend changes.",
    "No new navigation, pages, or additional UI features beyond updating the section background styling/image.",
    "Do not add any text, logos, faces, or character art into the background image."
  ],
  "imageRequirements": {
    "required": [
      "Atmospheric grunge texture background in black and charcoal with brush strokes and scratched paint, subtle controlled white highlights, optional abstract warrior-like silhouette without any face detail, minimal and moody (axses-hero-cinematic-texture.dim_1920x1080.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}