{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Home hero with new cinematic grunge background texture",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Add new generated cinematic grunge hero background image as a static frontend asset with the exact required filename and constraints (no text/logos/faces/characters).",
      "acceptanceCriteria": [
        "A new PNG exists at frontend/public/assets/generated/axses-hero-cinematic-texture.dim_1920x1080.png.",
        "The generated image is purely atmospheric: no readable text, no logos, no faces, and no identifiable character depiction.",
        "The overall exposure is not overly dark; contrast is controlled (no harsh/high-contrast highlights dominating the image).",
        "The image includes a black/charcoal grunge texture with brush/scratch effects; if a silhouette is present, it remains abstract and non-literal."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/axses-hero-cinematic-texture.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the newly generated PNG static asset at this exact path/filename. Ensure it matches the requested mood (Cyberpunk × Samurai × Dark Souls), stays purely atmospheric (no text/logos/faces/characters), avoids overly dark exposure, and avoids harsh contrast."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Switch the Home hero parallax background image to the new cinematic texture and tune the overlay gradient to remain moody without making the section too dark or high-contrast, keeping hero content/layout unchanged.",
      "acceptanceCriteria": [
        "frontend/src/components/home/HeroSection.tsx uses backgroundImage: url(/assets/generated/axses-hero-cinematic-texture.dim_1920x1080.png) (replacing the current /assets/generated/axses-hero-nature.dim_1920x1080.png).",
        "Hero content (title, studio name, tagline, CTA, credits block) remains present and positioned as before.",
        "The overlay/gradient on the hero background does not significantly darken the section beyond readability needs and does not introduce harsh contrast."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/home/HeroSection.tsx",
          "operation": "modify",
          "description": "Replace the hero backgroundImage reference with /assets/generated/axses-hero-cinematic-texture.dim_1920x1080.png and adjust the existing overlay gradient (currently bg-gradient-to-b from-background/50 via-background/30 to-background) to preserve readability while avoiding an overly dark or high-contrast look; do not change hero text content or layout structure."
        }
      ]
    }
  ]
}